////////////////////////////////////////////////////////////////////////////////
//! \ingroup ibp_limits
//! \file    ibp_limits.h
//! \brief   Файл с константами физических ограничений IBProvider-a
//! \author  Kovalenko Dmitry
//! \date    06.05.2006
#ifndef _ibp_limits_H_
#define _ibp_limits_H_

namespace lcpi{namespace ibp{
////////////////////////////////////////////////////////////////////////////////
//! \addtogroup ibp_limits
//! @{
////////////////////////////////////////////////////////////////////////////////

/// <summary>
///  Ограничение на количество регистрируемых ошибок в массовых операциях.
/// </summary>
const size_t ibp_limc_MaxErrorCountInBulkOperation=128;

////////////////////////////////////////////////////////////////////////////////

/// <summary>
///  Максимальное число байт для одного символа мультибайтной кодовой страницы
///  используется в по-символьной конвертации текстовых данных.
/// </summary>
//! \note Можно определить с огромным запасом
const size_t ibp_limc_MaxByteOfOneMultiByteSymbol=16;

////////////////////////////////////////////////////////////////////////////////

/// <summary>
///  Максимальное количество UNICODE символов для конвертирования одного
///  ASCII символа.
/// </summary>
//! \note Можно определить с огромным запасом
const size_t ibp_limc_MaxUnicodeSymbolsForOneMultiByteSymbol=8;

////////////////////////////////////////////////////////////////////////////////

/// <summary>
///  Максимальное число wchar_t символов для одного UTF8-символа
///  используется в по-символьной конвертации текстовых данных.
/// </summary>
//! \note Можно определить с огромным запасом
const size_t ibp_limc_MaxUnicodeSymbolsForOneUTF8Symbol=
              ibp_limc_MaxUnicodeSymbolsForOneMultiByteSymbol;

////////////////////////////////////////////////////////////////////////////////

/// <summary>
///  Максимальное количество параметров в описании ошибок
/// </summary>
//! Используется для настройки lib::structure::t_fix_vector
const size_t ibp_limc_MaxErrorArgsCount=12;

////////////////////////////////////////////////////////////////////////////////

/// <summary>
///  Максимальный "бинарный" размер блоб поля, для которого можно применять
///  прогнозирование размера после переконвертации
/// </summary>
const DBLENGTH ibp_limc_MaxRawBlobSizeForSizePrediction=4*1024;

////////////////////////////////////////////////////////////////////////////////
//! @}
////////////////////////////////////////////////////////////////////////////////
}/*nms ibp*/}/*nms lcpi*/
#endif
