////////////////////////////////////////////////////////////////////////////////
//! \ingroup db_obj
//! \file    db_charset_result.h
//! \brief   Определение кодов ошибок при работе с кодовыми страницами
//! \author  Kovalenko Dmitry
//! \date    06.12.2008
#ifndef _db_charset_result_H_
#define _db_charset_result_H_

namespace lcpi{namespace ibp{namespace db_obj{
////////////////////////////////////////////////////////////////////////////////
//! \addtogroup db_obj
//! @{
////////////////////////////////////////////////////////////////////////////////

/// <summary>
///  Коды ошибок конвертирования
/// </summary>
enum t_db_cs_result
{
 ///Произошла ошибка конвертирования
 db_cs_result__fail        =0,

 ///Нет ошибок
 db_cs_result__ok          =1,

 ///OUT-буфер имеет недостаточный размер для получения результата
 db_cs_result__trunc       =2,

 ///IN-буфер содержит незавершенные данные
 db_cs_result__input_trunc =3,
};//enum t_db_cs_result

////////////////////////////////////////////////////////////////////////////////
//! @}
////////////////////////////////////////////////////////////////////////////////
}/*nms db_obj*/}/*nms ibp*/}/*nms lcpi*/
#endif
