////////////////////////////////////////////////////////////////////////////////
//! \ingroup db_obj
//! \file    db_operation.h
//! \brief   Интерфейс операции
//! \author  Kovalenko Dmitry
//! \date    08.12.2010
#ifndef _db_operation_H_
#define _db_operation_H_

#include "source/db_obj/db_base.h"

namespace lcpi{namespace ibp{namespace db_obj{
////////////////////////////////////////////////////////////////////////////////
//! \addtogroup db_obj
//! @{
////////////////////////////////////////////////////////////////////////////////
//class t_db_operation

/// <summary>
///  Интерфейс операции
/// </summary>
//!  Под понятием "операция" понимается вызов метода класса. То есть операция
//!  завершается при выходе из этого метода.
//!
//!  Формально, класс не предназначен для динамически создаваемых объектов
class t_db_operation:public t_db_smart_interface
{
 public:
  /// <summary>
  ///  Отмена операции. Вызывается асинхронно.
  /// </summary>
  //!  Реализация должна возвести флаг отмены и вернуть управление.
  virtual void cancel()=0;
};//class t_db_operation

////////////////////////////////////////////////////////////////////////////////
//! @}
////////////////////////////////////////////////////////////////////////////////
}/*nms db_obj*/}/*nms ibp*/}/*nms lcpi*/
#endif
